<?php
set_time_limit(0);
/*$placeInfo = [
	202 => 'JW万豪酒店',
	27059 => '北京朝阳悠唐皇冠假日酒店',
	30653 => '北京东方美爵酒店',
	12606 => '北京富力万丽酒店',
	997 => '北京港澳中心瑞士酒店',
	1529 => '北京歌华开元大酒店',
	30564 => '北京工大建国饭店',
	28633 => '贵都大酒店',
	88 => '国宾酒店',
	15 => '北京国际饭店',
	28556 => '北京红杉假日酒店',
	131 => '北京皇家大饭店',
	258 => '北京嘉里大酒店',
	33304 => '北京金茂万丽酒店',
	26948 => '北京金隅喜来登酒店',
	1365 => '北京开元名都大酒店',
	27863 => '北京康莱德酒店',
	767 => '北京昆仑饭店',
	1378 => '北京丽晶酒店',
	39211 => '亮马河饭店',
	1390 => '北京诺富特和平宾馆',
	931 => '北京千禧大酒店',
	35147 => '北京泰富酒店',
	28432 => '北京天伦王朝酒店',
	14352 => '北京万达嘉华酒店',
	39274 => '万达索菲特大饭店',
	1442 => '北京万豪酒店',
	14571 => '北京文津国际酒店',
	1385 => '北京希尔顿逸林酒店',
	279 => '北京喜来登长城饭店',
	29676 => '新疆大厦',
	898 => '北京新侨诺富特饭店',
	30412 => '北京新世界酒店',
	1379 => '北京新云南皇冠假日酒店',
	14272 => '北京兴基铂尔曼饭店（大兴-亦庄经济开发区）',
	26500 => '亚洲大酒店',
	122 => '北京燕莎中心凯宾斯基饭店',
	1786 => '北京远通维景国际大酒店',
	33336 => '北京长安街w酒店',
	777 => '长峰假日酒店',
	17 => '北京长富宫饭店',
	290 => '北京兆龙饭店',
	1371 => '北京中奥马哥孛罗大酒店',
	187 => '北京中成天坛假日酒店',
	183 => '中国大饭店',
	3002859 => '成都安仁福朋喜来登酒店',
	28601 => '成都城市名人酒店',
	2594231 => '成都大鼎戴斯大酒店',
	28834 => '成都华西天使宾馆',
	27470 => '成都明宇尚雅饭店',
	27473 => '成都明悦大酒店',
	4495895 => '成都群光君悦酒店',
	28738 => '成都世代锦江国际酒店',
	1923 => '成都世纪城假日酒店',
	12928 => '成都世纪城天堂洲际大饭店',
	29824 => '成都世外桃源酒店',
	5642016 => '成都首座万豪酒店',
	28734 => '成都首座万丽酒店',
	1937 => '成都天府丽都喜来登饭店',
	36247 => '成都希尔顿酒店',
	727 => '成都香格里拉大酒店',
	36150 => '成都祥宇宾馆（原成都军区空军第一招待所）',
	29021 => '成都雅居乐豪生大酒店',
	3985 => '大河锦江饭店',
	842 => '大连国际金融会议中心',
	31024 => '大连君悦酒店',
	844 => '大连凯宾斯基饭店',
	101796 => '大连康莱德酒店',
	30050 => '大连瑞诗酒店',
	30897 => '大连万达希尔顿酒店',
	6602 => '大连香格里拉大饭店',
	30230 => '大连新世界酒店',
	1739 => '大连星海假日酒店',
	25675 => '大连远洋洲际酒店',
	29334 => '东北大学国际学术交流中心',
	31576 => '福州大饭店',
	37259 => '福州融侨皇冠假日酒店',
	36057 => '福州世茂洲际酒店',
	4989134 => '福州泰禾凯宾斯基酒店',
	26424 => '福州万达威斯汀酒店',
	1868 => '福州香格里拉大酒店',
	27912 => '福州中庚喜来登酒店',
	382 => '富豪东亚酒店',
	36939 => '富力君悦大酒店',
	33864 => '广西沃顿国际大酒店',
	686 => '广州白云宾馆',
	26945 => '广州白云万达希尔顿酒店',
	615 => '广州东方宾馆',
	31688 => '广州富力丽思卡尔顿酒店',
	26322 => '广州海航威斯汀酒店',
	700 => '广州花园酒店',
	705 => '广州凯旋华美达大酒店',
	31750 => '广州南丰朗豪酒店',
	26929 => '广州圣丰索菲特大酒店',
	196 => '广州香格里拉大酒店',
	655 => '广州远洋宾馆',
	26128 => '广州粤海喜来登酒店',
	26263 => '广州正佳广场万豪酒店',
	31147 => '广州中国大酒店',
	27064 => '广州中心皇冠假日酒店',
	36968 => '哈尔滨金河湾凯宾斯基饭店',
	35678 => '哈尔滨万达嘉华酒店',
	9975 => '哈尔滨香格里拉大饭店',
	29321 => '新巴黎大酒店',
	12601 => '哈尔滨正明锦江大酒店',
	29894 => '海口康年皇冠花园酒店',
	35563 => '海口鲁能希尔顿酒店',
	33761 => '海口万豪酒店',
	4102271 => '海口西海岸假日酒店',
	4644639 => '海口希尔顿酒店',
	29886 => '海口香格里拉大酒店',
	105241 => '海口中银海航国商酒店',
	26173 => '杭州JW万豪酒店',
	1283 => '杭州国大雷迪森广场酒店',
	34771 => '杭州华辰国际饭店',
	12593 => '杭州凯悦酒店',
	1286 => '杭州五洋宾馆',
	27013 => '杭州武林万怡酒店',
	372 => '杭州香格里拉饭店',
	12955 => '杭州洲际酒店',
	8104 => '河北世纪大饭店',
	35633 => '河北太行国宾馆',
	654 => '虹桥喜来登上海太平洋大饭店原上海喜来登豪达太平洋大饭店',
	612473 => '湖南财信国际商务酒店',
	33546 => '湖南佳兴世尊酒店',
	1922 => '济南贵和皇冠假日酒店',
	32574 => '济南绿地美利亚酒店',
	5836 => '山东大厦',
	2032781 => '济南舜和商务酒店（孙村店）',
	5837 => '济南索菲特银座大饭店',
	31505 => '济南万达凯悦酒店',
	22068 => '济南喜来登酒店',
	32487 => '济南银座佳悦酒店',
	761272 => '济南银座泉城大酒店',
	7615 => '江西宾馆  ',
	297 => '昆明君乐酒店（原海逸酒店）',
	31483 => '昆明七彩云南温德姆至尊豪廷大酒店',
	34323 => '昆明万达文华酒店',
	33415 => '昆明新纪元酒店',
	33352 => '昆明中心皇冠假日酒店',
	33341 => '昆明洲际酒店',
	34626 => '鲤城大酒店',
	37064 => '南昌凯美开元名都大酒店',
	27073 => '南昌力高皇冠假日酒店',
	5326207 => '南昌万达铂尔曼酒店',
	37155 => '南昌万达嘉华酒店',
	36067 => '南昌香格里拉大酒店',
	27857 => '南航明珠国际酒店（乌鲁木齐）',
	35978 => '南湖名都大酒店',
	1324 => '南京古南都饭店',
	43156 => '南京华泰万丽酒店',
	36185 => '南京金奥费尔蒙酒店',
	36074 => '南京金陵饭店',
	12578 => '南京金鹰珠江壹号国际酒店',
	30903 => '南京世茂滨江希尔顿酒店',
	12961 => '南京水游城假日酒店',
	802 => '南京索菲特银河大酒店',
	25683 => '南京威斯汀大酒店',
	36111 => '南京香格里拉大酒店',
	36329 => '南京银城皇冠假日酒店',
	35023 => '南宁红林大酒店',
	34558 => '南宁鑫伟万豪酒店',
	31740 => '宁波泛太平洋大酒店',
	1687 => '宁波万达索菲特大饭店',
	20838 => '宁波万豪酒店',
	20881 => '宁波香格里拉大酒店',
	31734 => '宁波逸东豪生大酒店',
	34133 => '宁波洲际酒店',
	29863 => '宁夏虹桥大酒店',
	32213 => '宁夏悦海宾馆',
	5459 => '青岛汇泉王朝大饭店',
	5459 => '青岛汇泉王朝大饭店',
	35243 => '青岛李沧绿城喜来登酒店',
	5834 => '青岛丽晶大酒店',
	32317 => '青岛鲁商凯悦酒店',
	21934 => '青岛万达艾美酒店',
	30845 => '青岛威斯汀酒店',
	1865 => '青岛香格里拉大酒店',
	1920 => '青岛颐中皇冠假日酒店',
	103905 => '青岛证大喜玛拉雅酒店',
	35158 => '青岛中心假日酒店',
	21195 => '泉州悦华酒店',
	21357 => '厦门艾美酒店',
	9300 => '厦门宝龙铂尔曼大酒店',
	21339 => '厦门宾馆',
	12947 => '厦门磐基皇冠假日酒店',
	30850 => '厦门日航酒店',
	30838 => '厦门威斯汀酒店',
	739 => '厦门喜来登酒店',
	5836 => '山东大厦',
	104972 => '山东舜和酒店',
	31375 => '山东银座泉城大酒店',
	30894 => '山西国贸大饭店',
	17111 => '山西迎泽宾馆（太原）',
	29114 => '陕西世纪金源大饭店',
	36134 => '上海巴黎春天新世界酒店',
	13195 => '上海财大豪生大酒店',
	315 => '上海淳大万丽酒店',
	12926 => '上海大华锦绣假日酒店',
	15671 => '上海大宁福朋喜来登酒店',
	184 => '上海福朋喜来登由由酒店',
	35722 => '上海复旦皇冠假日酒店',
	4608305 => '上海和平豪生酒店',
	28150 => '上海宏泉丽笙酒店',
	36572 => '上海虹口三至喜来登酒店',
	30853 => '上海静安香格里拉大酒店',
	105648 => '上海凯宾斯基大酒店',
	1635 => '上海龙之梦万丽酒店',
	34755 => '上海绿地假日酒店（原浦东盛高）',
	15409 => '上海明捷万丽酒店',
	16328 => '上海浦东福朋喜来登由由酒店',
	26287 => '上海浦东嘉里大酒店',
	34775 => '上海浦东绿地假日酒店',
	23152 => '上海浦东喜来登由由酒店',
	198 => '上海浦东香格里拉大酒店',
	29312 => '上海浦西开元大酒店',
	36469 => '上海浦西洲际酒店',
	406 => '上海齐鲁万怡大酒店',
	35123 => '上海瑞金洲际酒店',
	1893 => '上海神旺大酒店',
	12900 => '上海世博洲际酒店',
	35614 => '上海世茂皇家艾美酒店',
	36414 => '上海斯格威铂尔曼大酒店',
	1733 => '上海松江开元名都大酒店',
	1458 => '上海外滩茂悦大酒店',
	36605 => '上海威斯汀大饭店',
	192 => '上海希尔顿酒店',
	1462 => '上海新锦江大酒店',
	501 => '上海新世界丽笙大酒店',
	15417 => '上海兴荣温德姆至尊豪廷酒店',
	27017 => '上海雅居乐万豪酒店',
	305 => '上海扬子江万丽大酒店',
	1434 => '上海银星皇冠假日酒店',
	1801 => '上海裕景大饭店',
	660 => '深圳博林诺富特酒店',
	36848 => '深圳大中华希尔顿酒店',
	630 => '深圳大中华喜来登酒店',
	618 => '深圳东方银座美爵酒店',
	2008 => '深圳福田香格里拉大酒店',
	30314 => '深圳华安国际大酒店',
	30494 => '深圳凯宾斯基酒店',
	34724 => '深圳前海华侨城JW万豪酒店',
	731 => '深圳香格里拉大酒店',
	37235 => '深圳中洲万豪酒店',
	28090 => '沈阳保成希尔顿逸林酒店',
	28931 => '沈阳北约客维景国际大酒店',
	29334 => '东北大学国际学术交流中心',
	23151 => '沈阳国际皇冠假日酒店',
	29014 => '沈阳海韵锦江国际酒店',
	34890 => '沈阳今旅酒店（原沈阳盛贸饭店）',
	29121 => '沈阳君悦酒店',
	28932 => '沈阳七宝山饭店',
	28937 => '沈阳万达文华酒店',
	28961 => '沈阳香格里拉大酒店',
	8101 => '石家庄世贸广场酒店',
	27988 => '石家庄万达洲际酒店',
	30165 => '石家庄希尔顿酒店',
	27512 => '四川岷山饭店',
	35182 => '苏州福朋喜来登酒店',
	5534986 => '苏州高新华美达酒店',
	18664 => '苏州金鸡湖凯宾斯基大酒店',
	35189 => '苏州科技城源宿酒店',
	35286 => '苏州南园宾馆',
	35234 => '苏州万怡酒店',
	34717 => '苏州温德姆花园酒店（原苏州玄妙马哥孛罗酒店）',
	35626 => '苏州吴江盛虹万丽酒店',
	37283 => '苏州希尔顿逸林酒店',
	35224 => '苏州香格里拉大酒店',
	1333 => '苏州中茵皇冠假日酒店',
	35157 => '苏州洲际酒店',
	36147 => '太原富力铂尔曼大酒店',
	30881 => '太原凯宾斯基饭店',
	30837 => '太原万达文华酒店',
	29056 => '天津海河假日酒店',
	15235 => '天津君隆威斯汀酒店',
	29199 => '天津丽思卡尔顿酒店',
	29175 => '天津水游城假日酒店',
	29406 => '天津万达文华酒店',
	527068 => '天津万丽泰达酒店',
	277 => '天津喜来登大酒店',
	29008 => '天津中心唐拉雅秀酒店',
	27012 => '万丽天津宾馆',
	12839 => '唯实国际文化交流中心',
	34508 => '乌鲁木齐华凌雅高美爵大饭店',
	44349 => '乌鲁木齐万达文华酒店',
	27873 => '乌鲁木齐西北石油酒店',
	36014 => '乌鲁木齐希尔顿酒店',
	34222 => '武汉泛海喜来登酒店',
	34499 => '武汉光谷希尔顿酒店',
	2016 => '武汉光明万丽酒店',
	103935 => '武汉汉口泛海喜来登酒店',
	10174 => '武汉华美达天禄酒店',
	34633 => '武汉江城明珠豪生大酒店',
	28688 => '武汉欧亚会展国际酒店',
	5587902 => '武汉世茂希尔顿酒店',
	29541 => '武汉万达嘉华酒店',
	28876 => '武汉万达瑞华酒店',
	26293 => '武汉香格里拉大酒店',
	30677 => '武汉新世界酒店',
	10149 => '武汉亚洲大酒店',
	34235 => '西安大雁塔假日酒店',
	34776 => '西安高新亚朵酒店',
	34647 => '西安华美达兆瑞酒店',
	34255 => '西安皇城豪门酒店',
	29062 => '西安皇冠假日酒店',
	2013 => '西安金花豪生国际大酒店',
	29194 => '西安君乐城堡酒店',
	2010 => '西安索菲特人民大厦',
	30910 => '西安万达希尔顿酒店',
	26995 => '西安威斯汀大酒店',
	1863 => '西安香格里拉大酒店',
	29277 => '西安新兴戴斯大酒店',
	5642022 => '西安印力诺富特酒店',
	26954 => '喜来登乌鲁木齐酒店',
	25792 => '新疆中和大酒店',
	2531 => '新疆尊茂鸿福酒店',
	34314 => '银川国际交流中心酒店',
	34308 => '银川国贸中心假日酒店',
	4537602 => '银川金宇伊豪宾馆',
	34147 => '银川凯宾斯基饭店',
	34309 => '银川西府井饭店',
	33380 => '云南华地王朝大酒店',
	36012 => '长春金安大饭店',
	18021 => '长春开元名都大酒店',
	28036 => '长春香格里拉大酒店',
	777 => '长峰假日酒店',
	34087 => '长沙北辰洲际酒店',
	34607 => '长沙财信国际商务酒店',
	35019 => '长沙芙蓉国温德姆至尊豪廷大酒店',
	34112 => '长沙华雅国际大酒店',
	1924 => '长沙皇冠假日酒店',
	35387 => '长沙金麓国际大酒店',
	12626 => '长沙明城国际大酒店',
	27987 => '长沙融程花园酒店',
	843 => '长沙圣爵菲斯大酒店',
	34190 => '长沙世纪金源大饭店',
	34179 => '长沙顺天凯宾斯基酒店',
	3898 => '长沙通程国际大酒店',
	33947 => '长沙万达文华酒店',
	33885 => '长沙中国城戴斯酒店',
	26434 => '浙江三立开元名都大酒店',
	34999 => '郑州华美达广场酒店',
	2809624 => '郑州汇艺万怡酒店',
	102790 => '郑州建业艾美酒店',
	35002 => '郑州绿地JW万豪酒店',
	36069 => '郑州美盛喜来登酒店',
	3995 => '郑州索菲特国际饭店',
	30907 => '郑州希尔顿酒店',
	33923 => '郑州永和铂爵国际酒店',
	3994 => '裕达国贸酒店',
	104085 => '郑州长城饭店',
	35754 => '正方元锦江国际饭店',
	13045 => '重庆国贸格兰维大酒店',
	10651 => '重庆海逸酒店',
	29176 => '重庆恒大酒店',
	34262 => '重庆解放碑威斯汀酒店',
	29396 => '重庆凯宾斯基酒店',
	28836 => '重庆丽笙世嘉酒店',
	34299 => '重庆普惠豪生大酒店',
	29279 => '重庆融汇丽笙酒店',
	12614 => '重庆申基索菲特大酒店',
	16783 => '重庆万达艾美酒店',
	35047 => '重庆万豪酒店',
	734 => '重庆希尔顿酒店',
	36461 => '重庆渝州宾馆',
	12962 => '重庆洲际酒店',
	3889 => '紫东阁华天大酒店',
];*/

$placeInfo = [
734
];

function curl($url, $data = '') {
	$curl = curl_init();
	curl_setopt($curl, CURLOPT_URL, $url);
	curl_setopt($curl, CURLOPT_HEADER, true);
	curl_setopt($curl, CURLOPT_USERAGENT, $_SERVER['HTTP_USER_AGENT']);
	curl_setopt($curl, CURLOPT_FOLLOWLOCATION, true);
	curl_setopt($curl, CURLOPT_RETURNTRANSFER, true);
	curl_setopt($curl, CURLOPT_SSL_VERIFYPEER, 0);
	curl_setopt($curl, CURLOPT_SSL_VERIFYHOST, 0);
	curl_setopt($curl, CURLOPT_TIMEOUT, 30);
	curl_setopt($curl, CURLOPT_RETURNTRANSFER, 1);
	if (!empty($data)) {
		curl_setopt($curl, CURLOPT_POST, 1);
		curl_setopt($curl, CURLOPT_POSTFIELDS, $data);
	}
	$result = curl_exec($curl);
	//print_r($result);
	if (curl_errno($curl)) {
		return curl_errno($curl);
	}
	$result = explode("\r\n", $result);
	$result = array_pop($result);
	curl_close($curl);

	return $result;
}

function getAllData($placeInfo){
	$url = 'http://mapi.eventown.com/search?place_ids=';
	//$place_ids = array_keys( $placeInfo );
	$place_ids =  $placeInfo;
	//echo count($place_ids);exit;
	//echo "<br>";
	$place_str = implode(',',$place_ids);
	$reqUrl =  $url.$place_str;
	$strResult =  curl($reqUrl);
	$arrResult = json_decode( $strResult,true );
	$pageSize = 10;
	
	$result = $arrResult['rows'];
	$page = ceil( $arrResult['total'] / $pageSize );
	//$page = 1;
	
	for( $i = 1;$i<=$page;$i++ ){
		$tmpReqUrl[] = $reqUrl.'&page='.$i;
		//~ $tmpReqResult = json_decode( curl($tmpReqUrl),true );
		//~ foreach( $tmpReqResult['rows'] as $value ){
			//~ array_push( $result,$value );
		//~ }
	}
	return multiRequest($tmpReqUrl);
}

function multiRequest($data, $options = array()) {
 
	// array of curl handles
	$curly = array();
	// data to be returned
	$result = array();

	// multi handle
	$mh = curl_multi_init();

	// loop through $data and create curl handles
	// then add them to the multi-handle
	foreach ($data as $id => $d) {

		$curly[$id] = curl_init();

		$url = (is_array($d) && !empty($d['url'])) ? $d['url'] : $d;
		curl_setopt($curly[$id], CURLOPT_URL,            $url);
		curl_setopt($curly[$id], CURLOPT_HEADER,         0);
		curl_setopt($curly[$id], CURLOPT_RETURNTRANSFER, 1);

		// post?
		if (is_array($d)) {
			if (!empty($d['post'])) {
				curl_setopt($curly[$id], CURLOPT_POST,       1);
				curl_setopt($curly[$id], CURLOPT_POSTFIELDS, $d['post']);
			}
		}

		// extra options?
		if (!empty($options)) {
			curl_setopt_array($curly[$id], $options);
		}

		curl_multi_add_handle($mh, $curly[$id]);
	}

	// execute the handles
	$running = null;
	do {
		curl_multi_exec($mh, $running);
	} while($running > 0);

	// get content and remove handles
	foreach($curly as $id => $c) {
		$tmpResult = json_decode( curl_multi_getcontent($c),true );
		foreach( $tmpResult['rows'] as $value ){
			array_push( $result,$value );
		}
		curl_multi_remove_handle($mh, $c);
	}
	
	// all done
	curl_multi_close($mh);

	return $result;
}




